OK, so I just tested this myself but cannot reproduce it using the latest version of the TFE provider (and didn't try with older versions).

My setup looks like this:

1. I have a personal token configured in me `~/.terraformrc` file
2. Manually created a brand new workspace called `sander-test` and configured one sensitive environment variable called `TFE_TOKEN` with my personal token on the workspace.
3. Manually created a second brand new workspace called `sander-new-test`. Didn't configure anything on this workspace, just created it so it can be imported.
4. Created a new `main.tf` containing:
```
terraform {
  backend "remote" {
    organization = "my-test-org"
    workspaces { name = "sander-test" }
  }
}

provider "tfe" {}

resource "tfe_workspace" "default" {
  organization = "my-test-org"
  name         = "sander-new-test"
}
```
5. Run `terraform init`:
```
➜ terraform init                                                                                                                                                                            

Initializing the backend...

Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "tfe" (hashicorp/tfe) 0.17.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.tfe: version = "~> 0.17"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```
6. Run `terraform plan`:
```
➜ terraform plan                                                                                                                  
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-test-org/sander-test/runs/run-pNL857gSiHvYtrxu

Waiting for the plan to start...

Terraform v0.12.25
Configuring remote state backend...
Initializing Terraform configuration...
2020/05/24 11:53:05 [DEBUG] Using modified User-Agent: Terraform/0.12.25 TFC/c6d59bd658
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tfe_workspace.default will be created
  + resource "tfe_workspace" "default" {
      + auto_apply            = false
      + external_id           = (known after apply)
      + file_triggers_enabled = true
      + id                    = (known after apply)
      + name                  = "sander-new-test"
      + operations            = true
      + organization          = "my-test-org"
      + queue_all_runs        = true
      + terraform_version     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
7. Run `terraform import tfe_workspace.default ws-unxkRhe7dZp9aQXa
```
➜ terraform import tfe_workspace.default ws-unxkRhe7dZp9aQXa                                                                                                                                             
tfe_workspace.default: Importing from ID "ws-unxkRhe7dZp9aQXa"...
tfe_workspace.default: Import prepared!
  Prepared tfe_workspace for import
tfe_workspace.default: Refreshing state... [id=ws-unxkRhe7dZp9aQXa]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```
8 Run `terraform plan` again to confirm:
```
➜ terraform plan
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-test-org/sander-test/runs/run-sNkVEeB6PsZN7BSj

Waiting for the plan to start...

Terraform v0.12.25
Configuring remote state backend...
Initializing Terraform configuration...
2020/05/24 11:57:14 [DEBUG] Using modified User-Agent: Terraform/0.12.25 TFC/c6d59bd658
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

tfe_workspace.default: Refreshing state... [id=ws-unxkRhe7dZp9aQXa]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # tfe_workspace.default will be updated in-place
  ~ resource "tfe_workspace" "default" {
        auto_apply            = true
        external_id           = "ws-unxkRhe7dZp9aQXa"
      ~ file_triggers_enabled = false -> true
        id                    = "ws-unxkRhe7dZp9aQXa"
        name                  = "sander-new-test"
        operations            = true
        organization          = "my-test-org"
      ~ queue_all_runs        = false -> true
        terraform_version     = "0.12.25"
        trigger_prefixes      = []
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

So what did I miss, what are you doing differently?

Just for the record I also tried it with the exact same files @kuwas posted here, but I needed to call the file `default.auto.tfvars` for it to be picked up. If you didn't need to do that, then did you maybe specify the variable as a `Terraform` var instead of an `Environment` var on the workspace?

With a `default.auto.tfvars` file and the `vars.tfe_token` assigned in the TFE provider block (and still a sensitive `TFE_TOKEN` env var on the `sander-test` workspace), I got the exact same results without any errors.

I guess the first thing we need to do is that one of you tests it again using the latest version of the TFE provider. If the problem persists with the latest version then please try to spot the difference between your test and mine and tell me how I should replicate the problem.

Thanks!